package LR6.Example1;

public class Example1 {
    //символьное поле
    char ch;
    //текстовое поле
    String str;
    //перегруженный метод, который присваивает значение символьному полю
    void Set (char ch1) {
        ch = ch1;

    }
    //перегруженный метод, который присваивает значение текстовому полю
    void Set (String str1) {
        str = str1;
    }
    //перегруженный метод, который присваивает значение текстовому или символьному полю
    //взависимости от длины символьного массива
    void Set (char[] chars) {
        if (chars.length == 1) {
            ch = chars[0];
        } else if (chars.length > 1) {
            str = String.valueOf(chars);
        }
    }


}
/*1 Напишите программу с классом, в котором есть два поля:
символьное и текстовое. В классе должен быть перегруженный
метод для присваивания значений полям. Если метод вызывается
с символьным аргументом, то соответствующее значение присваивается
символьному полю. Если метод вызывается с текстовым аргументом, то
он определяет значение текстового ноля. Методу аргументом также
может передаваться символьный массив. Если массив состоит из одного
элемента, то он определяет значение символьного поля. В противном случае
(если в массиве больше одного элемента) из символов массива формируется
текстовая строка и присваивается значением текстовому полю.*/