package LR6.Example3;


public class Example3_Main {

    public static void main(String[] args) {

        Example3.resultMax(1, -4);
        Example3.resultMin(10, -3, 15);
        Example3.resultAvg(5, 3, 5, 8);
    }
}



/*3. Напишите программу с классом, в котором есть статические методы,
которым можно передавать произвольное количество целочисленных аргументов
(или целочисленный массив). Методы, на основании переданных аргументов или массива,
позволяют вычислить: наибольшее значение, наименьшее значение,
а также среднее значение из набора чисел.*/
